<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Plearn-core] Impl&#233;menter un Learner
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/plearn-core/2006-October/index.html" >
   <LINK REL="made" HREF="mailto:plearn-core%40lists.berlios.de?Subject=Re%3A%20%5BPlearn-core%5D%20%3D%3Fiso-8859-1%3Fq%3FImpl%3DE9menter_un_Learner%3F%3D&In-Reply-To=%3C20061024194952.GA15213%40opale.iro.umontreal.ca%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000222.html">
   <LINK REL="Next"  HREF="000226.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Plearn-core] Impl&#233;menter un Learner</H1>
    <B>Olivier Delalleau</B> 
    <A HREF="mailto:plearn-core%40lists.berlios.de?Subject=Re%3A%20%5BPlearn-core%5D%20%3D%3Fiso-8859-1%3Fq%3FImpl%3DE9menter_un_Learner%3F%3D&In-Reply-To=%3C20061024194952.GA15213%40opale.iro.umontreal.ca%3E"
       TITLE="[Plearn-core] Impl&#233;menter un Learner">delallea at iro.umontreal.ca
       </A><BR>
    <I>Tue Oct 24 21:49:53 CEST 2006</I>
    <P><UL>
        <LI>Previous message: <A HREF="000222.html">[Plearn-core] Impl&#233;menter un Learner
</A></li>
        <LI>Next message: <A HREF="000226.html">[Plearn-core] Impl&#233;menter un Learner
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#223">[ date ]</a>
              <a href="thread.html#223">[ thread ]</a>
              <a href="subject.html#223">[ subject ]</a>
              <a href="author.html#223">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Salut,

Pas de chance, PLearn est tr&#232;s mal foutu pour les inputs de taille
variable (c'est un de ses gros d&#233;fauts &#224; l'heure actuelle).
Je sais que ceux qui ont travaill&#233; avec de tels inputs ont plus ou moins
chacun cod&#233; leurs 'hacks' perso pour pouvoir le faire, mais je ne sais
plus exactement comment.
Voil&#224; une suggestion relativement facile &#224; impl&#233;menter pour ton
probl&#232;me :
- rajoute une option dans ton learner qui est le fichier correspondant &#224;
  ta base de donn&#233;es initiale (ou, si tu travailles en m&#233;moire, un
  pointeur direct vers tes donn&#233;es)
- remplace ton jeu de donn&#233;es par une VMat dont l'input est remplac&#233; par
  l'index de l'exemple dans ta base de donn&#233;es originale, et la target
  par contre est toujours la m&#234;me

Maintenant, quand ton learner doit faire un calcul &#224; partir de l'exemple
dont l'input est juste un seul nombre r&#233;el 'x', r&#233;cup&#232;re les vraies
donn&#233;es en castant 'x' en int (int x_int = int(round(x)) par s&#233;curit&#233;)
et en utilisant le r&#233;sultat pour r&#233;cup&#233;rer l'exemple num&#233;ro x_int, de la
mani&#232;re que tu pr&#233;f&#232;res.

Le makeDeepCopyFromShallowCopy(..) est, comme son nom l'indique, appel&#233;
apr&#232;s l'op&#233;ration de 'shallow copy', qui va automatiquement copier les
types simples comme real, int, bool, string (et &#224; peu pr&#232;s tous les
trucs std), etc.
Le r&#244;le de CopiesMap est de se souvenir de quels objets ont d&#233;j&#224; &#233;t&#233;
deep-copi&#233;s, afin d'&#233;viter de les deep-copier plusieurs fois. Par
exemple si A et B ont un champ sub_learner de type PP&lt;PLearner&gt;, et que
A.sub_learner == B.sub_learner == my_learner, et qu'un objet C a un
champ qui est un vecteur contenant A et B, la deep-copie de C va
entra&#238;ner :
- la deep-copie de A, qui va entra&#238;ner la deep-copie de my_learner
- la deep-copie de B, qui va vouloir deep-copier my_learner aussi, mais
  il va se rendre compte qu'il a d&#233;j&#224; &#233;t&#233; deep-copi&#233;, donc le champ
  B.sub_learner va plut&#244;t pointer vers cette deep-copie plut&#244;t que de
  recr&#233;er une nouvelle deep_copy (ce qui assure qu'on aura toujours
  A.sub_learner == B.sub_learner)

--
Olivier

On 24 Oct 2006, Jaonary Rabarisoa wrote:
&gt;<i> Bonjour tout le monde,
</I>&gt;<i> 
</I>&gt;<i> Je continue toujours mon aventure dans le monde de PLearn. Ne trouvant pas mon
</I>&gt;<i> bonheur parmis les milliers de PLearner d&#233;j&#224; impl&#233;ment&#233;s dans PLearn, je
</I>&gt;<i> voudrais maintenant impl&#233;menter le mien :) Suis-je un peu fou ? 
</I>&gt;<i> Concr&#232;tement, je voudrai r&#233;soudre un probl&#232;me de classification binaire dans un
</I>&gt;<i> espace form&#233; par l'ensemble de liste de taille fini de vecteur dans R^d. Ouff.
</I>&gt;<i> Plus simplement, si X est mon input alors il s'&#233;crira 
</I>&gt;<i> 
</I>&gt;<i> X = {X_i, i = 1, ..., l(X) et X_i dans R^d}
</I>&gt;<i> 
</I>&gt;<i> L'id&#233;e ici c'est d'utiliser des m&#233;thodes d'aggr&#233;gation (boosting). Et pour
</I>&gt;<i> faire simple je commence par adaboost. 
</I>&gt;<i> Chouette adaboost est d&#233;j&#224; dans PLearn. Mais ..... Je dois en fait impl&#233;menter
</I>&gt;<i> mon propre weak learner et c'est la que c'est un peu technique. Tous les
</I>&gt;<i> learner de PLearn prends comme entr&#233; un Vec. A moins que j'ai loup&#233; quelque
</I>&gt;<i> chose. Donc 1ere question, il y t-il des exemples de learner qui prennent autre
</I>&gt;<i> chose que les Vec en entr&#233;e ( graphe , liste, ... ) pour que je m'en inspire ?
</I>&gt;<i> 
</I>&gt;<i> Si c'est pas le cas, est-ce que c'est envisageable et comment pourrais-je les
</I>&gt;<i> impl&#233;ment&#233; pour que ca suive la philosophie de PLearn ? Notamment, j'avais
</I>&gt;<i> l'intension d'utiliser la classe adaboost de PLearn en lui donnant tout
</I>&gt;<i> simplement le weak learner que j'aurai impl&#233;ment&#233;. Au fait, on aurait aim&#233; que
</I>&gt;<i> les inputs sont des smart pointer sur un input g&#233;n&#233;rique. Genre une notion de
</I>&gt;<i> feature space qui me permet de r&#233;soudre un probl&#232;me dans l'espace que je veux.
</I>&gt;<i> 
</I>&gt;<i> Au point de vue purement impl&#233;mentation, j'aimerai aussi avoir une petite
</I>&gt;<i> pr&#233;cision sur la fonction makeDeepCopyFromShallow(). J'ai bien compris que
</I>&gt;<i> c'est pour copier les smart pointer mais que deviennent les membre qui ne sont
</I>&gt;<i> pas des smart pointer comme real, int, bool, ... Aussi, quel est exactement le
</I>&gt;<i> r&#244;le de MapCopies ? 
</I>&gt;<i> 
</I>&gt;<i> Bien &#224; vous,
</I>&gt;<i> 
</I>&gt;<i> Jaonary
</I>
</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000222.html">[Plearn-core] Impl&#233;menter un Learner
</A></li>
	<LI>Next message: <A HREF="000226.html">[Plearn-core] Impl&#233;menter un Learner
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#223">[ date ]</a>
              <a href="thread.html#223">[ thread ]</a>
              <a href="subject.html#223">[ subject ]</a>
              <a href="author.html#223">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/plearn-core">More information about the Plearn-core
mailing list</a><br>
</body></html>
